function[a1,a2,a3]=Actual_Cosine_theorem(x,y,x1,y1,x2,y2)
%% 该函数用于求解实际坐标系三个角度的大小
% x=1;x2=2;x1=3;y=6;y1=5;y2=7;
L=50;
e1=(x-x2)^2+(y-y2)^2+(x-x1)^2+(y-y1)^2-((x2-x1)^2+(y2-y1)^2);
e2=2*sqrt((x-x2)^2+(y-y2)^2)*sqrt((x-x1)^2+(y-y1)^2);
e3=(x-x1)^2+(y-y1)^2+(x-3.532*L)^2+(y-1.98*L)^2-((3.532*L-x1)^2+(1.98*L-y1)^2);
e4=2*sqrt((x-x1)^2+(y-y1)^2)*sqrt((x-3.532*L)^2+(y-1.98*L)^2);
e5=(x-x2)^2+(y-y2)^2+(x-3.532*L)^2+(y-1.98*L)^2-((3.532*L-x2)^2+(1.98*L-y2)^2);
e6=2*sqrt((x-x2)^2+(y-y2)^2)*sqrt((x-3.532*L)^2+(y-1.98*L)^2);
a1=acos(e1/e2)/pi*180;
a2=acos(e3/e4)/pi*180;
a3=acos(e5/e6)/pi*180;
end